# види транспорту
tran = input("Введи вид транспорту (автомобіль, велосипед, самокат, пішки, метро: ): ")

match tran:
    case "автомобіль":
        print("Швидко\n+ = зручно\n- = затрати на бензин")
    case "велосипед":
        print("Швидше середнього\n+ = незатратний\n- = прикладаєш багато роботи")
    case "самокат":
        print("Середньо\n+ = компактно\n - = не достатньо швидко")
    case "пішки":
        print("повільно\n+ = корисно для здоровя\n - = занадто повільно")
    case "метро":
        print("Найшвидше\n+ = дуже швидко\n - = дорогий проїзд")
    case _:
        print("неправильно написано.")
