# Завдання 1
метри = float(input("Введіть кількість метрів: "))


сантиметри = метри * 100
дециметри = метри * 10
міліметри = метри * 1000
милі = метри * 0.00062


print(f"{метри} метрів = {сантиметри} см")
print(f"{метри} метрів = {дециметри} дм")
print(f"{метри} метрів = {міліметри} мм")
print(f"{метри} метрів = {милі} миль")

# Завдання 2
основа = float(input("Введіть основу трикутника: "))
висота = float(input("Введіть висоту трикутника: "))

площа = 0.5 * основа * висота

print(f"Площа трикутника = {площа}")
