# Завдання 1
day_number = int(input("Введіть номер дня тижня (1-7): "))

days_of_week = {
    1: "понеділок",
    2: "вівторок",
    3: "середа",
    4: "четвер",
    5: "п’ятниця",
    6: "субота",
    7: "неділя"
}

if 1 <= day_number <= 7:
    print("День тижня:", days_of_week[day_number])
else:
    print("Некоректний номер дня тижня")

# Завдання 2
month_number = int(input("Введіть номер місяця (1-12): "))

months_of_year = {
    1: "січень",
    2: "лютий",
    3: "березень",
    4: "квітень",
    5: "травень",
    6: "червень",
    7: "липень",
    8: "серпень",
    9: "вересень",
    10: "жовтень",
    11: "листопад",
    12: "грудень"
}

if 1 <= month_number <= 12:
    print("Місяць:", months_of_year[month_number])
else:
    print("Некоректний номер місяця")
