balance = 5000
print(f"Ваш поточний баланс - {balance} грн")
while True:
    a = str(input("Оберіть дію для взаємодії з балансом(зняти, поповнити, вийти) - "))

    if a == "вийти":
        print(f"Ваш кінцевий баланс - {balance} грн, гарного дня!")
        break

    elif a == "зняти":
        b = int(input("Введіть суму для зняття: "))
        if b > balance:
            print("Недостатньо коштів, спробуйте ще раз")
        elif b < balance:
            c = balance - b
            print(f"Ви зняли {b} грн, ваш баланс - {c} грн")


    elif a == ("поповнити"):
        d = int(input("Введіть суму для поповнення балансу - "))
        if d < 0:
            print("Сума не може бути меньше за 0")
        else:
            e = balance + d
            print(f"Ваш баланс попвнено на {d} грн, ваш баланс - {e} грн")




